---
kind: property
id: P:Autodesk.Revit.DB.Electrical.GroundConductorSizeSet.IsEmpty
source: html/422d0b51-4d47-de26-5eb9-4ad2b3e2ae5e.htm
---
# Autodesk.Revit.DB.Electrical.GroundConductorSizeSet.IsEmpty Property

Test to see if the set is empty.

## Syntax (C#)
```csharp
public virtual bool IsEmpty { get; }
```

## Remarks
If the set is empty then True will be returned, otherwise False.